---
kind: property
id: P:Autodesk.Revit.DB.DGNExportOptions.FileVersion
source: html/af039e20-22e3-8aa5-cdb0-adff48a92d36.htm
---
# Autodesk.Revit.DB.DGNExportOptions.FileVersion Property

The DGN file version.
 Default value of fileVersion is DGNFileFormat.Default.

## Syntax (C#)
```csharp
public DGNFileFormat FileVersion { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration